# vim: set filetype=ruby
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/cask-fonts"

brew "neovim"
brew "gh"
brew "fzf"
brew "ripgrep"
brew "git"
brew "htop"
brew "jq"
brew "socat"
brew "tcpdump"
brew "nmap"
brew "tmux"
brew "tree"
brew "neofetch"
brew "starship"
brew "ssh-copy-id"
brew "wget"
brew "python"

brew "fnm"
brew "go"
brew "svn"
brew "shellcheck"
brew "shfmt"
brew "docker"
brew "awscli"
brew "cfssl"
#brew "docker-compose"
brew "yq"

brew "terraform"
brew "k9s"
brew "k6"
brew "helm"
brew "minikube"

cask "font-inconsolata"
cask "font-inconsolata-g-for-powerline"
cask "font-fira-code"
cask "kitty"
cask "google-cloud-sdk"
cask "google-chrome"
cask "docker"
cask "firefox"
cask "postman"
cask "discord"
cask "visual-studio-code"
cask "spotify"
#cask "rancher"

# Missing?
# coreutils bash kind krew postgresql docker-compose
