# vim: set filetype=ruby
tap "coinbase/assume-role"
tap "datawire/blackbird"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/dupes"
tap "homebrew/php"
tap "neovim/neovim"
#cask "java"
#cask "osxfuse"
brew "python"
brew "aspell"
brew "aws-shell"
brew "awscli"
brew "bash-completion"
#brew "bazel"
brew "cfssl"
brew "ctags"
#brew "gettext"
brew "curl", args: ["with-openssl"]
brew "go"
brew "dep"
brew "docker-completion"
brew "docker-compose-completion"
brew "docker-machine-driver-xhyve"
#brew "forego"
brew "fpp"
brew "fzf"
brew "git"
brew "graphviz"
#brew "hadolint"
brew "htop"
#brew "httpie"
brew "hub"
brew "jq"
#brew "kafkacat"
#brew "kops"
#brew "kubernetes-helm"
#brew "maven"
#brew "mitmproxy"
brew "neovim"
brew "nmap"
brew "pssh"
brew "pyenv-virtualenv"
#brew "rename"
brew "screen"
brew "shellcheck"
brew "socat"
brew "ssh-copy-id"
brew "tcpdump"
brew "terraform"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "vagrant-completion"
brew "vim", args: ["with-override-system-vi"], link: false
brew "wget"
brew "coinbase/assume-role/assume-role"
brew "datawire/blackbird/telepresence"
#cask "android-studio"
#cask "bitbar"
#cask "bluemix-cli"
#cask "charles"
#cask "citrix-receiver"
cask "docker"
#cask "enpass"
cask "firefox"
cask "flux"
cask "font-inconsolata"
cask "font-inconsolata-g-for-powerline"
cask "garmin-express"
cask "google-chrome"
cask "google-cloud-sdk"
cask "google-drive"
#cask "gpgtools"
#cask "intellij-idea"
#cask "intellij-idea-ce"
cask "iterm2"
#cask "java8"
cask "keepassxc"
cask "keepingyouawake"
#cask "keybase"
cask "minikube"
#cask "skype"
cask "spectacle"
cask "spotify"
cask "vagrant"
#cask "vagrant-manager"
cask "virtualbox"
#cask "vlc"
