# vim: set filetype=ruby
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "homebrew/core"

tap "neovim/neovim"
brew "neovim", args: ["head"]

tap "github/gh"
brew "gh"

brew "aspell"
brew "bash-completion"
brew "ctags"
brew "fzf"
brew "git"
brew "graphviz"
brew "htop"
brew "hub"
brew "jq"
brew "socat"
brew "ssh-copy-id"
brew "tcpdump"
brew "nmap"
brew "screen"
brew "shellcheck"
brew "shfmt"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "wget"
brew "svn"
brew "yq"
brew "rclone"
brew "neofetch"
brew "starship"
brew "pre-commit"

brew "awscli"
brew "cfssl"
brew "minikube"
brew "terraform"
brew "packer"
brew "bazelisk"

brew "nvm"

brew "python"
brew "pipenv"

brew "go"
brew "docker"

tap "homebrew/cask-fonts"
cask "font-inconsolata"
cask "font-inconsolata-g-for-powerline"

cask "alacritty"
cask "iterm2"
cask "firefox"
cask "google-cloud-sdk"
cask "keepassxc"
cask "spotify"
cask "vagrant"
cask "virtualbox"
cask "session-manager-plugin"
#cask "google-chrome"
#cask "citrix-receiver"
